vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN536_DFP.pdsc
    <condition id="component.els_pkc.memory.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.param_integrity, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.param_integrity, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_param_integrity"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca.condition_id">
      <require condition="allOf.component.els_pkc.crc, component.els_pkc.oscca_aeadmodes, component.els_pkc.oscca_ciphermodes, component.els_pkc.oscca_macmodes, component.els_pkc.oscca_pkc, component.els_pkc.oscca_randommodes, component.els_pkc.oscca_safo, component.els_pkc.oscca_sm2, component.els_pkc.oscca_sm3, component.els_pkc.oscca_sm4, component.els_pkc.signature, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.crc, component.els_pkc.oscca_aeadmodes, component.els_pkc.oscca_ciphermodes, component.els_pkc.oscca_macmodes, component.els_pkc.oscca_pkc, component.els_pkc.oscca_randommodes, component.els_pkc.oscca_safo, component.els_pkc.oscca_sm2, component.els_pkc.oscca_sm3, component.els_pkc.oscca_sm4, component.els_pkc.signature, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_crc"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_oscca_aeadmodes"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_oscca_ciphermodes"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_oscca_macmodes"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_oscca_pkc"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_oscca_randommodes"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_oscca_safo"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_oscca_sm2"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_oscca_sm3"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_oscca_sm4"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_signature"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_aeadmodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.common, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_common"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_ciphermodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_macmodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_pkc.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_randommodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_safo.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_sm2.condition_id">
      <require condition="allOf.component.els_pkc.common, component.els_pkc.signature, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.common, component.els_pkc.signature, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_common"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_signature"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_sm3.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_sm4.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.padding.condition_id">
      <require condition="allOf.component.els_pkc.buffer, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.param_integrity.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.pkc.condition_id">
      <require condition="allOf.component.els_pkc.ecc, component.els_pkc.math, component.els_pkc.rsa, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.ecc, component.els_pkc.math, component.els_pkc.rsa, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_ecc"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_math"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_rsa"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.platform.mcxn.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=device_id=MCXN536, component.els_pkc.trng.type_els, component.els_pkc.random_modes_ctr.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=device_id=MCXN536, component.els_pkc.trng.type_els, component.els_pkc.random_modes_ctr.internal_condition">
      <require condition="anyOf.allOf=anyOf=device_id=MCXN536, component.els_pkc.trng.type_els.internal_condition"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_random_modes_ctr"/>
    </condition>
