vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN536_DFP.pdsc
    <condition id="allOf.component.els_pkc.rsa, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_rsa"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.secure_counter.condition_id">
      <require condition="allOf.device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.session.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.random, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.random, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_random"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.signature.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.standalone_gdet.condition_id">
      <require condition="allOf.component.els_pkc.els_header_only, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els_header_only, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_els_header_only"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.static_lib.mcxn.condition_id">
      <require condition="allOf.anyOf=device_id=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.toolchain.condition_id">
      <require condition="allOf.device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.trng.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.trng.type_els.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.trng, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els, component.els_pkc.trng, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_els"/>
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.trng.type_rng4.condition_id">
      <require condition="allOf.component.els_pkc.trng, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.trng, device=MCXN536.internal_condition">
      <require Cclass="MCXN536 els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9544.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9548.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="component.eth_phy_common.condition_id">
      <require condition="allOf.driver.common, device=MCXN536.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MCXN536.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXN536.internal_condition"/>
    </condition>
    <condition id="component.flash_adapter.condition_id">
      <require condition="allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MCXN536.internal_condition"/>
    </condition>
