vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN536_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXN536_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXN536_cmsis</description>
      <files>
        <file category="header" name="devices/MCXN536/fsl_device_registers.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN536/MCXN536_cm33_core0.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN536/MCXN536_cm33_core0_COMMON.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN536/MCXN536_cm33_core0_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXN536/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_AHBSC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_BSP32.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_CACHE64_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_CACHE64_POLSEL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_CAN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_CDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_CMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_CRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_CTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_DIGTMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_DM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_EIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_EMVSIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_ENET.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_ERM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_EVTG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_EWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_FLEXIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_FLEXSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_FMU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_FMUTEST.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_FREQME.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_GDET.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_HPDAC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_I3C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_INPUTMUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_INTM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_ITRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_LPCMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_LPDAC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_LPI2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_LPSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_LPTMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_LPUART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_LP_FLEXCOMM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_MAILBOX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_MRT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_NPX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_OPAMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_OSTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_OTPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_PDM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_PINT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_PKC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_PLU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_PORT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_POWERQUAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_PUF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_PWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_QDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_RTC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_S50.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_SCG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_SCT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_SEMA42.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_SINC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_SMARTDMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_SPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_SYSCON.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_SYSPM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_TRDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_TSI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_USBDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_USBHS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_USBHSDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_USBNC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_UTICK.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_VBAT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_VREF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_WUU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN536/periph/PERI_WWDT.h" projectpath="device/periph"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MCXN536/MCXN536_cm33_core1.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MCXN536/MCXN536_cm33_core1_COMMON.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MCXN536/MCXN536_cm33_core1_features.h" projectpath="device"/>
        <file category="include" name="devices/MCXN536/"/>
        <file category="include" name="devices/MCXN536/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXN536/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXN536/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXN536_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXN536_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/arm/MCXN536_cm33_core0_flash.scf" version="1.0.0" projectpath="MCXN536/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/arm/MCXN536_cm33_core0_flash_ns.scf" version="1.0.0" projectpath="MCXN536/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/arm/MCXN536_cm33_core0_flash_s.scf" version="1.0.0" projectpath="MCXN536/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/arm/MCXN536_cm33_core0_ram.scf" version="1.0.0" projectpath="MCXN536/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/arm/MCXN536_cm33_core1_flash.scf" version="1.0.0" projectpath="MCXN536/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/arm/MCXN536_cm33_core1_ram.scf" version="1.0.0" projectpath="MCXN536/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/gcc/MCXN536_cm33_core0_flash.ld" version="1.0.0" projectpath="MCXN536/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/gcc/MCXN536_cm33_core0_flash_ns.ld" version="1.0.0" projectpath="MCXN536/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/gcc/MCXN536_cm33_core0_flash_s.ld" version="1.0.0" projectpath="MCXN536/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/gcc/MCXN536_cm33_core0_ram.ld" version="1.0.0" projectpath="MCXN536/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/gcc/MCXN536_cm33_core1_flash.ld" version="1.0.0" projectpath="MCXN536/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/gcc/MCXN536_cm33_core1_ram.ld" version="1.0.0" projectpath="MCXN536/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/iar/MCXN536_cm33_core0_flash.icf" version="1.0.0" projectpath="MCXN536/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/iar/MCXN536_cm33_core0_flash_ns.icf" version="1.0.0" projectpath="MCXN536/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/iar/MCXN536_cm33_core0_flash_s.icf" version="1.0.0" projectpath="MCXN536/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/iar/MCXN536_cm33_core0_ram.icf" version="1.0.0" projectpath="MCXN536/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/iar/MCXN536_cm33_core1_flash.icf" version="1.0.0" projectpath="MCXN536/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MCXN536.condition_id" category="linkerScript" attr="config" name="devices/MCXN536/iar/MCXN536_cm33_core1_ram.icf" version="1.0.0" projectpath="MCXN536/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXN536" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXN536</description>
      <files>
        <file category="header" attr="config" name="devices/MCXN536/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN536/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN536/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN536/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN536/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN536/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN536/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN536/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXN536/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXN536_startup</description>
      <files>
        <file condition="allOf.toolchains=iar, core_ids=cm33_core0.condition_id" category="sourceAsm" attr="config" name="devices/MCXN536/iar/startup_MCXN536_cm33_core0.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm33_core0.condition_id" category="sourceAsm" attr="config" name="devices/MCXN536/gcc/startup_MCXN536_cm33_core0.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm33_core0.condition_id" category="sourceAsm" attr="config" name="devices/MCXN536/arm/startup_MCXN536_cm33_core0.S" version="1.0.0" projectpath="startup/arm"/>
        <file condition="allOf.toolchains=iar, core_ids=cm33_core1.condition_id" category="sourceAsm" attr="config" name="devices/MCXN536/iar/startup_MCXN536_cm33_core1.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm33_core1.condition_id" category="sourceAsm" attr="config" name="devices/MCXN536/gcc/startup_MCXN536_cm33_core1.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm33_core1.condition_id" category="sourceAsm" attr="config" name="devices/MCXN536/arm/startup_MCXN536_cm33_core1.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXN536_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXN536_system</description>
      <files>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="sourceC" name="devices/MCXN536/system_MCXN536_cm33_core0.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN536/system_MCXN536_cm33_core0.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="sourceC" name="devices/MCXN536/system_MCXN536_cm33_core1.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MCXN536/system_MCXN536_cm33_core1.h" projectpath="device"/>
        <file category="include" name="devices/MCXN536/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_cache64" Cversion="2.0.11" condition="driver.cache_cache64.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN536/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN536/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN536/drivers/"/>
      </files>
    </component>
